<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<!-- Document generated by Thot -->
<title>adrDemo.3</title>
<link href="adrDemo.toc.html" rel="ToC">
</head>
<body>

<div class=Section>
<h2><a name="secta3">3</a> Demo/rpc/Html</h2>

<p>Contiens tous les fichiers html utilis&eacute; par la d&eacute;monstration.
Attention certain fichiers on des extensions mime priv&eacute; a la class
TcpHttpRpc et ne peuvent donc pas &ecirc;tre trait&eacute; par un serveur WEB
ordinaire.</p>

<ul>
<li>frameAdr.html c'est la page d'introduction de la d&eacute;monstration,
elle est d&eacute;coup&eacute;e en trois sous frame qui inclue respectivement
les pages:
<ol>
<li>idxAdr c'est la page de choix de fonction &agrave; r&eacute;aliser [login,
logout, set, get, ...] elle est affich&eacute;e dans le frame de gauche.
<li>htmlAdr.html est affich&eacute; dans le frame du bas, c'est l'aide en
ligne de l'application.
<li>loginAdr.html est affich&eacute;e dans la page principale et attend le nom
de login de l'utilisateur.
</ol>

<li>error.html est retourn&eacute; par le serveur a chaque fois d'une URL
fausse est donn&eacute;e par l'utilisateur.
<li>setAdr.html permet de saisir une adresse
<li>getAdr permet de recher une adresse d&eacute;j&agrave; saisie
<li>in.thtml cette page poss&egrave;de une extension mime sp&eacute;cifique
qui est trait&eacute; par la classe TcpHttpdRpc. Toutes les tags &lt;tcl
...&gt; qu'elle contiens seront remplac&eacute; par par le r&eacute;sultat de
l'ex&eacute;cution de la dite commande ce qui permet de retourner le nom de
l'interpr&egrave;teur esclave attach&eacute; &agrave; la session ainsi que le
nom du fichier de s&eacute;rialisation des objects adresses.
<li>out.html tout comme la page in.thtml cette page est pars&eacute;e par le
serveur jTcl et retourne le nom du fichier de s&eacute;rialisation ainsi que
le nom de l'interpreteur esclave qui va &ecirc;tre d&eacute;truit.
</ul>
</div>
<hr>
<p><a href="adrDemoX.html">[Last section]</a>   <a
href="./adrDemo.toc.html">[Table of contents]</a>
</body>
</html>
