<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<!-- Document generated by Thot -->
<title>adrDemo</title>
<link href="adrDemo.toc.html" rel="ToC">
<link href="adrDemo.idx1.html" rel="Index">
</head>
<body>

<h1><a name="ti">Agenda d'adresse</a></h1>
<address>Fulup Ar Foll</address>
<code>jTcl Web Tools<br></code>
<dl>
<dt><b>Abstract:</b>
<dd>Ce program d&eacute;montre l'interaction d'un server WEB avec des routines
de traitement applicatives. Il stocke des adresses dans un groupement
d'objecta et les s&eacute;riais sur disque en sortie, il est bas&eacute; sur
une instauration non modifi&eacute;e de la class TcpHttpdRpc.</dl>
<dl>
<dt><b>R&eacute;sum&eacute; :</b>
<dd>
<p>This program demonstrate interaction between a WEB server and application
subroutines. It take adress comming from an HTML form and store them thru a
serialization mechanism on logout. It is based on  a non modified TcpHttpdRpc
class.</p>
</dl>

<hr>

<p>Cette d&eacute;mo instancie la class TcpHttpdRpc, elle utilise une petit
module applicatif qui g&egrave;re un carnet d'adresses. Chaque adresse est
instanci&eacute;e comme un objet. Au logout l'ensemble des objects adresses
est s&eacute;rialis&eacute; sur un fichier disque, se fichier sera
recharg&eacute; lors du login suivant. </p>

<p>A chaque nouveau client [login] un interpreteur esclave est
cr&eacute;&eacute;, cette interpreteur est enrichie des modules de
registration "slaves.jTcl" trouv&eacute; dans l'auto path de donn&eacute; en
param&egrave;tre a l'instanciation de l'objet serveur, par la suite a chaque
validation d'une forme par l'utilisateur le serveur va ex&eacute;cuter la
proc&eacute;dure du m&ecirc;me nom dans le contexte de l'interpreteur escale.
</p>

<p>Le m&eacute;canisme de cr&eacute;ation d'un interpreteur esclave par
nouveau client permet d'assurer la coh&eacute;rence et
l'&eacute;tanch&eacute;it&eacute; entre chaque client et ce
ind&eacute;pendamment des bugs de l'application.</p>

<p>En sortie [logout] le syst&egrave;me va srialiser sur disk les object
adresse saisie pendant la session, le nom du fichier utiliser est afficher
lors des phases de login et de logout. Dans le cas ou la demo n'aurait pas les
droit suffisant &agrave; cr&eacute;er une fichier dans le r&eacute;pertoire
/tmp les adresses saisie lors d'une session serait simplement perdu lors du
logout.</p>

<p>Note: La demo n'implemente aucun m&eacute;canisme de s&eacute;curit&eacute;
sp&eacute;cifique, ceci pourrait &ecirc;tre implement&eacute; soit dans la
proc&eacute;dure login, dans le cas d'un contr&ocirc;le applicatif, ou
directement via une class d&eacute;riv&eacute; de TclHttpdRpc dans le cas
d'une r&eacute;elle politique s&eacute;curitaire. De la m&ecirc;me
mani&egrave;re la s&eacute;rialisation est utilis&eacute;e pour le stockage
d'adresse alors qu'elle est avant tout destin&eacute;e au stockage de
param&egrave;tre de configuration et quand aucun cas ce m&eacute;canisme ne
serait adapt&eacute; au stockage d'une grande quantit&eacute; d'objets.</p>
<hr>
<p><a href="adrDemo1.html">[Section 1]</a>   <a
href="./adrDemo.toc.html">[Table of contents]</a>
</body>
</html>
