<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<html>
<head>
<!-- Document generated by Thot -->
<title>adrDemo.2</title>
<link href="adrDemo.toc.html" rel="ToC">
</head>
<body>

<div class=Section>
<h2><a name="secta2">2</a> L'organisation disk</h2>

<p>Adr est organis&eacute; sous la forme standard projet/module des outils
FRIDU [cf Common].  </p>

<div class=Section>
<h3><a name="sectb21">2.1</a> Demo/Etc</h3>

<p>Contiens le fichier projets.mk qui d&eacute;fini le r&eacute;pertoire
d'installation est les options de compilation par d&eacute;faut des
d&eacute;monstrations. </p>

<p>Nota: La demo Adr n'utilise aucun modules compil&eacute; mais elle a
toutefois besoin du fichier projects.mk pour l'installation dans le
r&eacute;f&eacute;renciel de production avec la commande build.mk.</p>
</div>

<div class=Section>
<h3><a name="sectb22">2.2</a> Demo/Adr/Etc</h3>

<p>Contiens deux fichiers:</p>

<ul>
<li>module.mk d&eacute;fini le sous r&eacute;pertoire d'installation dans le
r&eacute;f&eacute;rentiel de production [lib/Adr].
<li>packages.jTcl defini les path d'acc&egrave;s au d&eacute;f&eacute;rent
module de la d&eacute;monstration, c'est ce fichier qui permet de trouver les
fichiers/path en fonction du mode dans lequel se trouve le programme
[d&eacute;veloppement | production] Au d&eacute;marrage le fichier
package.jTcl registre dans la base jTcl les labels qui permettrons au module
d'importer les diff&eacute;rent ficher de la demo Ad [cf: fonction
jCLassRegister/jClassImport]
</ul>
</div>

<div class=Section>
<h3><a name="sectb23">2.3</a> Demo/Adr/server/Tcl</h3>

<p>Contiens le fichier httpAdr.jTcl qui est le programme principal de la
d&eacute;monstration, ce programme r&eacute;cup&egrave;re les trois
information n&eacute;cessaire au lancement d'un server WEB RPC dans la base de
registrery de jTcl:</p>

<ul>
<li>ROOT_DIR la directory de base utilis&eacute;e par le server WEB, en mode
d&eacute;veloppent ce r&eacute;pertoire est &eacute;gal a $TOP/Demo/Adr.
<li>AUTO D&eacute;fini le path de recherche des modules jTcl applicatif, dans
le cas de la d&eacute;monstration Adr ce path ce r&eacute;sume au seul
r&eacute;pertoire rpc. Au d&eacute;marrage du serveur la class TcpHttpdRpc
recherche les fichiers Etc/Slaves.jTcl dans ce path. Par la suite a chaque
nouveau login d'un client WEB ces fichiers seront sourc&eacute;s dans
l'interpreteur esclave attach&eacute; &agrave; la connection. 
</ul>

<ul>
<li>INDEX donne le nom du fichier a retourner quand le path de l'URL est "/"
Dans la demo Adr l'index est un frame compos&eacute; des trois
&eacute;l&eacute;ments qui d&eacute;finies l'application.
</ul>
</div>

<div class=Section>
<h3><a name="sectb24">2.4</a> Demo/Adr/rpc</h3>

<p>Ce r&eacute;pertoire contiens la partie applicative de la
d&eacute;monstration, il est compose de deux r&eacute;pertoires.</p>

<ol>
<li>Etc qui contiens le module de registration slaves.jTcl qui est
sourc&eacute; au login dans l'interpr&eacute;teur esclave attach&eacute;
&agrave; la connexion. Ce module force aussi  l'inclusion du programme
principale de l'application qui dans le cas de la demo Adr est le seul module
pr&eacute;sent.
<li>Tcl qui contiens le module applicatif en lui m&ecirc;me, le fichier
rpcAdrDemo.jTcl qui poss&egrave;de une proc&eacute;dure par form disponible
dans les pages HTML plus les fonctions login et logout qui sont appel&eacute;e
automatiquement par la classe TcpHttpdRpc.
<ul>
<li>login cette fonction n'est pas implemente car l'application poss&egrave;de
une fonction explicite de login.
<li>logout bien que l'application poss&egrave;de aussi une fonction explicite
de logout, la fonction logout doit &ecirc;tre impl&eacute;ment&eacute;e en
effet l'application peut quitter soit parque l'utilisateur le demande, mais
aussi parce qu'elle tombe en timeout.
<li>login.adr, cette fonction est attach&eacute;e &agrave; la forme login.adr
du fichier loginAdr.html, elle re&ccedil;oit en param&egrave;tre le nom de
login et l'utilise soit pour cr&eacute;er un fichier de sauvegard&eacute; par
s&eacute;rialisation des adresse saisie, soit pour recharger les objects
cr&eacute;e lors d'une pr&eacute;c&eacute;dente session.
<li>set.adr re&ccedil;oit en param&egrave;tre tous les champs saisie dans la
form set.adr du fichier setAdr.html, elle appelle la m&eacute;thode set de
l'object HtmlAdress cr&eacute;e lors du login. Cette m&eacute;thode
cr&eacute;er un object par adresse, chaqun des objects adresse est
agr&eacute;g&eacute; a l'object principal. 
<li>get.adr re&ccedil;oit en param&egrave;tre le nom recherch&eacute;,
&acirc;pres l'avoir transform&eacute; en minuscule v&eacute;rifie que le nom
existe bien dans l'object HtmlAdress puis r&eacute;cup&egrave;re l'object et
g&eacute;r&egrave;re dynamiquement la pge HTML de retour.
</ul>

</ol>
</div>
</div>
<hr>
<p><a href="adrDemo3.html">[Section 3]</a>   <a
href="./adrDemo.toc.html">[Table of contents]</a>
</body>
</html>
